# Project part 3

#### Loading libraries and data

In [1]:
import numpy as np
import pandas as pd
import seaborn as sns
import matplotlib.pyplot as plt
import seaborn as sns
import os, json
import warnings
import pymysql
pymysql.install_as_MySQLdb()
from urllib.parse import quote_plus
from sqlalchemy.types import*
from sqlalchemy import create_engine
from sqlalchemy_utils import create_database, database_exists
import scipy.stats as stats
warnings.filterwarnings(action ='ignore')

In [2]:
username = "root"
password = "Root"
db_name = "movies_db"
connection_str = f"mysql+pymysql://{username}:{password}@localhost/{db_name}"

In [3]:
engine = create_engine(connection_str)

In [4]:
engine

Engine(mysql+pymysql://root:***@localhost/movies_db)

In [5]:
create_database(connection_str)
database_exists(connection_str)

True

In [6]:
if database_exists(connection_str) == False:
  create_database(connection_str)
else:
  print('The database already exists')

The database already exists

In [7]:
basics_df = pd.read_csv("/Users/dell/Documents/DATA/title_basics.csv.gz")
ratings_df = pd.read_csv("/Users/dell/Documents/DATA/title_ratings.csv.gz")
tmdb2000_df = pd.read_csv("/Users/dell/Downloads/Datafinal_tmdb_data_2000.csv.gz")
tmdb2001_df = pd.read_csv("/Users/dell/Downloads/Datafinal_tmdb_data_2001.csv.gz")

#### Clean and normalize data for all dfs and only keep needed columns

In [8]:
basics_df['genres_sep'] = basics_df['genres'].str.split(',')
basics_df

,tconst,titleType,primaryTitle,originalTitle,isAdult,startYear,endYear,runtimeMinutes,genres,genres_sep
0,tt0035423,movie,Kate & Leopold,Kate & Leopold,0,2001.0,NaN,118,"Comedy,Fantasy,Romance","[Comedy, Fantasy, Romance]"
1,tt0062336,movie,The Tango of the Widower and Its Distorting Mi...,El tango del viudo y su espejo deformante,0,2020.0,NaN,70,Drama,[Drama]
2,tt0069049,movie,The Other Side of the Wind,The Other Side of the Wind,0,2018.0,NaN,122,Drama,[Drama]
3,tt0088751,movie,The Naked Monster,The Naked Monster,0,2005.0,NaN,100,"Comedy,Horror,Sci-Fi","[Comedy, Horror, Sci-Fi]"
4,tt0096056,movie,Crime and Punishment,Crime and Punishment,0,2002.0,NaN,126,Drama,[Drama]
...,...,...,...,...,...,...,...,...,...,...
86547,tt9914942,movie,Life Without Sara Amat,La vida sense la Sara Amat,0,2019.0,NaN,74,Drama,[Drama]
86548,tt9915872,movie,The Last White Witch,My Girlfriend is a Wizard,0,2019.0,NaN,97,"Comedy,Drama,Fantasy","[Comedy, Drama, Fantasy]"
86549,tt9916170,movie,The Rehearsal,O Ensaio,0,2019.0,NaN,51,Drama,[Drama]
86550,tt9916190,movie,Safeguard,Safeguard,0,2020.0,NaN,95,"Action,Adventure,Thriller","[Action, Adventure, Thriller]"
86551,tt9916362,movie,Coven,Akelarre,0,2020.0,NaN,92,"Drama,History","[Drama, History]"

In [9]:
#seperate each genre with explode
exploded_genres = basics_df.explode('genres_sep')
exploded_genres

,tconst,titleType,primaryTitle,originalTitle,isAdult,startYear,endYear,runtimeMinutes,genres,genres_sep
0,tt0035423,movie,Kate & Leopold,Kate & Leopold,0,2001.0,NaN,118,"Comedy,Fantasy,Romance",Comedy
0,tt0035423,movie,Kate & Leopold,Kate & Leopold,0,2001.0,NaN,118,"Comedy,Fantasy,Romance",Fantasy
0,tt0035423,movie,Kate & Leopold,Kate & Leopold,0,2001.0,NaN,118,"Comedy,Fantasy,Romance",Romance
1,tt0062336,movie,The Tango of the Widower and Its Distorting Mi...,El tango del viudo y su espejo deformante,0,2020.0,NaN,70,Drama,Drama
2,tt0069049,movie,The Other Side of the Wind,The Other Side of the Wind,0,2018.0,NaN,122,Drama,Drama
...,...,...,...,...,...,...,...,...,...,...
86550,tt9916190,movie,Safeguard,Safeguard,0,2020.0,NaN,95,"Action,Adventure,Thriller",Action
86550,tt9916190,movie,Safeguard,Safeguard,0,2020.0,NaN,95,"Action,Adventure,Thriller",Adventure
86550,tt9916190,movie,Safeguard,Safeguard,0,2020.0,NaN,95,"Action,Adventure,Thriller",Thriller
86551,tt9916362,movie,Coven,Akelarre,0,2020.0,NaN,92,"Drama,History",Drama
86551,tt9916362,movie,Coven,Akelarre,0,2020.0,NaN,92,"Drama,History",History

In [10]:
#save unique ids for genre column
unique_genres = sorted(exploded_genres ['genres_sep'].unique())
unique_genres

['Action',
 'Adult',
 'Adventure',
 'Animation',
 'Biography',
 'Comedy',
 'Crime',
 'Drama',
 'Family',
 'Fantasy',
 'Game-Show',
 'History',
 'Horror',
 'Music',
 'Musical',
 'Mystery',
 'News',
 'Reality-TV',
 'Romance',
 'Sci-Fi',
 'Short',
 'Sport',
 'Talk-Show',
 'Thriller',
 'War',
 'Western']

#### creating titles and genres tables

In [11]:
title_genres = exploded_genres[['tconst', 'genres_sep']]
title_genres.head()

      tconst genres_sep
0  tt0035423     Comedy
0  tt0035423    Fantasy
0  tt0035423    Romance
1  tt0062336      Drama
2  tt0069049      Drama

In [12]:
genres_id = range(len(unique_genres))
genres_id
#0-864 is the range of unique genres'

range(0, 26)

In [13]:
#zipping the variables together to make a dictionary 
genre_map = dict(zip(unique_genres, genres_id))
genre_map

{'Action': 0,
 'Adult': 1,
 'Adventure': 2,
 'Animation': 3,
 'Biography': 4,
 'Comedy': 5,
 'Crime': 6,
 'Drama': 7,
 'Family': 8,
 'Fantasy': 9,
 'Game-Show': 10,
 'History': 11,
 'Horror': 12,
 'Music': 13,
 'Musical': 14,
 'Mystery': 15,
 'News': 16,
 'Reality-TV': 17,
 'Romance': 18,
 'Sci-Fi': 19,
 'Short': 20,
 'Sport': 21,
 'Talk-Show': 22,
 'Thriller': 23,
 'War': 24,
 'Western': 25}

In [14]:
basics_df = exploded_genres

In [15]:
basics_df['genres_Id'] = basics_df['genres_sep'].replace(genre_map)
basics_df.head()

,tconst,titleType,primaryTitle,originalTitle,isAdult,startYear,endYear,runtimeMinutes,genres,genres_sep,genres_Id
0,tt0035423,movie,Kate & Leopold,Kate & Leopold,0,2001.0,NaN,118,"Comedy,Fantasy,Romance",Comedy,5
0,tt0035423,movie,Kate & Leopold,Kate & Leopold,0,2001.0,NaN,118,"Comedy,Fantasy,Romance",Fantasy,9
0,tt0035423,movie,Kate & Leopold,Kate & Leopold,0,2001.0,NaN,118,"Comedy,Fantasy,Romance",Romance,18
1,tt0062336,movie,The Tango of the Widower and Its Distorting Mi...,El tango del viudo y su espejo deformante,0,2020.0,NaN,70,Drama,Drama,7
2,tt0069049,movie,The Other Side of the Wind,The Other Side of the Wind,0,2018.0,NaN,122,Drama,Drama,7

In [16]:
genres = pd.DataFrame({'Genre_Name': genre_map.keys(),
                        'Genre_ID': genre_map.values()})

In [17]:
genres.head()
#genres tables created

  Genre_Name  Genre_ID
0     Action         0
1      Adult         1
2  Adventure         2
3  Animation         3
4  Biography         4

In [18]:
title_genres = pd.DataFrame({'tconst': basics_df['tconst'],
                        'Genre_ID': basics_df['genres_Id']})

In [19]:
title_genres.head()

      tconst  Genre_ID
0  tt0035423         5
0  tt0035423         9
0  tt0035423        18
1  tt0062336         7
2  tt0069049         7

In [20]:
#drop genres
basics_df =basics_df.drop(columns = ['genres_sep','originalTitle', 'isAdult', 'titleType','genres','genres_Id','endYear'])

In [21]:
#check it was dropped 
basics_df.head()

,tconst,primaryTitle,startYear,runtimeMinutes
0,tt0035423,Kate & Leopold,2001.0,118
0,tt0035423,Kate & Leopold,2001.0,118
0,tt0035423,Kate & Leopold,2001.0,118
1,tt0062336,The Tango of the Widower and Its Distorting Mi...,2020.0,70
2,tt0069049,The Other Side of the Wind,2018.0,122

In [22]:
basics_df.info()

<class 'pandas.core.frame.DataFrame'>
Int64Index: 161653 entries, 0 to 86551
Data columns (total 4 columns):
 #   Column          Non-Null Count   Dtype
---  ------          --------------   -----
 0   tconst          161653 non-null  object
 1   primaryTitle    161653 non-null  object
 2   startYear       161653 non-null  float64
 3   runtimeMinutes  161653 non-null  int64
dtypes: float64(1), int64(1), object(2)
memory usage: 6.2+ MB

In [23]:
#cleaning and combining rating df and the final tbdb data from 2000 and 2001

In [24]:
ratings_df.head()
#doesnt need to be normalized seems pretty good as is

      tconst  averageRating  numVotes
0  tt0000001            5.7      1966
1  tt0000002            5.8       263
2  tt0000005            6.2      2607
3  tt0000006            5.2       181
4  tt0000007            5.4       816

In [25]:
ratings_df.duplicated().sum()
#no duplicates

0

In [26]:
tmdb2000_df.head()

,imdb_id,adult,backdrop_path,belongs_to_collection,budget,genres,homepage,id,original_language,original_title,...,revenue,runtime,spoken_languages,status,tagline,title,video,vote_average,vote_count,certification
0,0,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,...,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
1,tt0113026,0.0,/vMFs7nw6P0bIV1jDsQpxAieAVnH.jpg,NaN,10000000.0,"[{'id': 35, 'name': 'Comedy'}, {'id': 10402, '...",NaN,62127.0,en,The Fantasticks,...,0.0,86.0,"[{'english_name': 'English', 'iso_639_1': 'en'...",Released,Try to remember the first time magic happened,The Fantasticks,0.0,5.50,22.0,NaN
2,tt0113092,0.0,NaN,NaN,0.0,"[{'id': 878, 'name': 'Science Fiction'}]",NaN,110977.0,en,For the Cause,...,0.0,100.0,"[{'english_name': 'English', 'iso_639_1': 'en'...",Released,The ultimate showdown on a forbidden planet.,For the Cause,0.0,5.10,8.0,NaN
3,tt0116391,0.0,NaN,NaN,0.0,"[{'id': 18, 'name': 'Drama'}, {'id': 28, 'name...",NaN,442869.0,hi,Gang,...,0.0,152.0,"[{'english_name': 'Hindi', 'iso_639_1': 'hi', ...",Released,NaN,Gang,0.0,4.00,1.0,NaN
4,tt0118694,0.0,/n4GJFGzsc7NinI1VeGDXIcQjtU2.jpg,NaN,150000.0,"[{'id': 18, 'name': 'Drama'}, {'id': 10749, 'n...",NaN,843.0,cn,花樣年華,...,12854953.0,99.0,"[{'english_name': 'Cantonese', 'iso_639_1': 'c...",Released,"Feel the heat, keep the feeling burning, let t...",In the Mood for Love,0.0,8.12,2207.0,PG

In [27]:
#drop columns not needed from both then merge them into one df/ table (lots to drop jus specified which ones to keep)
tmdb2000_df= tmdb2000_df[['imdb_id', 'revenue', 'budget','certification']]
tmdb2000_df.head()

     imdb_id     revenue      budget certification
0          0         NaN         NaN           NaN
1  tt0113026         0.0  10000000.0           NaN
2  tt0113092         0.0         0.0           NaN
3  tt0116391         0.0         0.0           NaN
4  tt0118694  12854953.0    150000.0            PG

In [28]:
tmdb2001_df= tmdb2001_df[['imdb_id', 'revenue', 'budget','certification']]
tmdb2001_df.head()

     imdb_id     revenue      budget certification
0          0         NaN         NaN           NaN
1  tt0035423  76019048.0  48000000.0         PG-13
2  tt0114447         0.0         0.0           NaN
3  tt0118589   5271666.0  22000000.0         PG-13
4  tt0118652         0.0   1000000.0             R

In [29]:
tmdb_merged = pd.concat([tmdb2001_df, tmdb2000_df], axis = 0)

In [30]:
tmdb_merged.head()

     imdb_id     revenue      budget certification
0          0         NaN         NaN           NaN
1  tt0035423  76019048.0  48000000.0         PG-13
2  tt0114447         0.0         0.0           NaN
3  tt0118589   5271666.0  22000000.0         PG-13
4  tt0118652         0.0   1000000.0             R

In [31]:
tmdb_merged.info()
#tmdb merged data is ready for the db

<class 'pandas.core.frame.DataFrame'>
Int64Index: 2562 entries, 0 to 1233
Data columns (total 4 columns):
 #   Column         Non-Null Count  Dtype
---  ------         --------------  -----
 0   imdb_id        2562 non-null   object
 1   revenue        2560 non-null   float64
 2   budget         2560 non-null   float64
 3   certification  815 non-null    object
dtypes: float64(2), object(2)
memory usage: 100.1+ KB

## Dowloading data to MySQL

In [32]:
basics_df.duplicated().sum()

75101

In [33]:
basics_df.drop_duplicates(inplace = True)

In [34]:
basics_df.duplicated().sum()

0

In [35]:
basics_df.info()

<class 'pandas.core.frame.DataFrame'>
Int64Index: 86552 entries, 0 to 86551
Data columns (total 4 columns):
 #   Column          Non-Null Count  Dtype
---  ------          --------------  -----
 0   tconst          86552 non-null  object
 1   primaryTitle    86552 non-null  object
 2   startYear       86552 non-null  float64
 3   runtimeMinutes  86552 non-null  int64
dtypes: float64(1), int64(1), object(2)
memory usage: 3.3+ MB

In [36]:
## get max string length
key_len = basics_df['tconst'].fillna('').map(len).max()
title_len = basics_df['primaryTitle'].fillna('').map(len).max()

df_schema = {'tconst':String(key_len+1),
    'primaryTitle': Text(title_len+1),
    'startYear': Float(),
    'runtimeMinutes': Integer()}

In [37]:
## Set the dataframe index and use index=True 
basics_df.to_sql('title_basics',engine,dtype = df_schema,if_exists = 'replace', index = False)

86552

In [38]:
engine.execute('ALTER TABLE title_basics ADD PRIMARY KEY (`tconst`);')

In [39]:
ratings_df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 496761 entries, 0 to 496760
Data columns (total 3 columns):
 #   Column         Non-Null Count   Dtype
---  ------         --------------   -----
 0   tconst         496761 non-null  object
 1   averageRating  496761 non-null  float64
 2   numVotes       496761 non-null  int64
dtypes: float64(1), int64(1), object(1)
memory usage: 11.4+ MB

In [40]:
key_len = ratings_df['tconst'].fillna('').map(len).max()
df_schema = {'tconst':String(key_len+1),
            'averageRating': Float(),
            'numVotes': Integer()}

In [41]:
ratings_df.to_sql('title_ratings',engine,dtype = df_schema,if_exists = 'replace', index = False)

496761

In [42]:
engine.execute('ALTER TABLE title_ratings ADD PRIMARY KEY (`tconst`);')

In [43]:
title_genres.info()

<class 'pandas.core.frame.DataFrame'>
Int64Index: 161653 entries, 0 to 86551
Data columns (total 2 columns):
 #   Column    Non-Null Count   Dtype
---  ------    --------------   -----
 0   tconst    161653 non-null  object
 1   Genre_ID  161653 non-null  int64
dtypes: int64(1), object(1)
memory usage: 3.7+ MB

In [44]:
title_genres.duplicated().sum()

0

In [45]:
title_genres.drop_duplicates(inplace= True)

In [46]:
key_len = title_genres['tconst'].fillna('').map(len).max()
df_schema = {'tconst':String(key_len+1),
            'Genre_ID': Integer()}

In [47]:
title_genres.to_sql('title_genres',engine,dtype = df_schema,if_exists = 'replace', index = False)

161653

In [49]:
genres.head()

  Genre_Name  Genre_ID
0     Action         0
1      Adult         1
2  Adventure         2
3  Animation         3
4  Biography         4

In [50]:
key_len = genres['Genre_Name'].fillna('').map(len).max()
df_schema = {'Genre_Name':Text(key_len+1),
            'Genre_ID': Integer()}

In [51]:
genres.to_sql('genres',engine,dtype = df_schema,if_exists = 'replace', index = False)

26

In [52]:
engine.execute('ALTER TABLE genres ADD PRIMARY KEY (`Genre_ID`);')

In [53]:
tmdb_merged.info()

<class 'pandas.core.frame.DataFrame'>
Int64Index: 2562 entries, 0 to 1233
Data columns (total 4 columns):
 #   Column         Non-Null Count  Dtype
---  ------         --------------  -----
 0   imdb_id        2562 non-null   object
 1   revenue        2560 non-null   float64
 2   budget         2560 non-null   float64
 3   certification  815 non-null    object
dtypes: float64(2), object(2)
memory usage: 100.1+ KB

In [59]:
tmdb_merged.duplicated().sum()

1

In [60]:
tmdb_merged.drop_duplicates(inplace = True)

In [62]:
key_len = tmdb_merged['imdb_id'].fillna('').map(len).max()
cert_len = tmdb_merged['certification'].fillna('').map(len).max()
df_schema = {'imdb_id':String(key_len+1),
    'revenue': Float(),
    'budget': Float(),
    'certification':Text(cert_len+1)}

In [63]:
tmdb_merged.to_sql('tmdb_data',engine,dtype = df_schema,if_exists = 'replace', index = False)

2561

In [64]:
engine.execute('ALTER TABLE tmdb_data ADD PRIMARY KEY (`imdb_id`);')

In [65]:
q = """SHOW TABLES;"""
pd.read_sql(q,engine)

  Tables_in_movies_db
0              genres
1        title_basics
2        title_genres
3       title_ratings
4           tmdb_data